{
    "char2id": {
        "\n": 1,
        " ": 2,
        "!": 3,
        "\"": 4,
        "#": 5,
        "%": 6,
        "'": 7,
        "(": 8,
        ")": 9,
        "*": 10,
        "+": 11,
        ",": 12,
        "-": 13,
        ".": 14,
        "/": 15,
        "0": 16,
        "1": 17,
        "2": 18,
        "3": 19,
        "4": 20,
        "5": 21,
        "6": 22,
        "7": 23,
        "8": 24,
        "9": 25,
        ":": 26,
        ";": 27,
        "<": 28,
        "=": 29,
        ">": 30,
        "?": 31,
        "@": 32,
        "A": 33,
        "B": 34,
        "C": 35,
        "D": 36,
        "E": 37,
        "F": 38,
        "G": 39,
        "H": 40,
        "I": 41,
        "J": 42,
        "K": 43,
        "L": 44,
        "M": 45,
        "N": 46,
        "O": 47,
        "P": 48,
        "Q": 49,
        "R": 50,
        "S": 51,
        "T": 52,
        "U": 53,
        "V": 54,
        "W": 55,
        "X": 56,
        "Y": 57,
        "Z": 58,
        "[": 59,
        "]": 60,
        "_": 61,
        "a": 62,
        "b": 63,
        "c": 64,
        "d": 65,
        "e": 66,
        "f": 67,
        "g": 68,
        "h": 69,
        "i": 70,
        "j": 71,
        "k": 72,
        "l": 73,
        "m": 74,
        "n": 75,
        "o": 76,
        "p": 77,
        "q": 78,
        "r": 79,
        "s": 80,
        "t": 81,
        "u": 82,
        "v": 83,
        "w": 84,
        "x": 85,
        "y": 86,
        "z": 87,
        "|": 88,
        "«": 89,
        "»": 90,
        "А": 91,
        "Б": 92,
        "В": 93,
        "Г": 94,
        "Д": 95,
        "Е": 96,
        "Ж": 97,
        "З": 98,
        "И": 99,
        "Й": 100,
        "К": 101,
        "Л": 102,
        "М": 103,
        "Н": 104,
        "О": 105,
        "П": 106,
        "Р": 107,
        "С": 108,
        "Т": 109,
        "У": 110,
        "Ф": 111,
        "Х": 112,
        "Ц": 113,
        "Ч": 114,
        "Ш": 115,
        "Щ": 116,
        "Ы": 117,
        "Ь": 118,
        "Э": 119,
        "Ю": 120,
        "Я": 121,
        "а": 122,
        "б": 123,
        "в": 124,
        "г": 125,
        "д": 126,
        "е": 127,
        "ж": 128,
        "з": 129,
        "и": 130,
        "й": 131,
        "к": 132,
        "л": 133,
        "м": 134,
        "н": 135,
        "о": 136,
        "п": 137,
        "р": 138,
        "с": 139,
        "т": 140,
        "у": 141,
        "ф": 142,
        "х": 143,
        "ц": 144,
        "ч": 145,
        "ш": 146,
        "щ": 147,
        "ъ": 148,
        "ы": 149,
        "ь": 150,
        "э": 151,
        "ю": 152,
        "я": 153,
        "ё": 154,
        "–": 155,
        "—": 156,
        "“": 157,
        "”": 158,
        "•": 159,
        "…": 160,
        "№": 161,
        "↑": 162,
        "→": 163,
        "↓": 164,
        "−": 165,
        "ꜝ": 166,
        "": 167,
        "<pad>": 0
    },
    "id2char": {
        "1": "\n",
        "2": " ",
        "3": "!",
        "4": "\"",
        "5": "#",
        "6": "%",
        "7": "'",
        "8": "(",
        "9": ")",
        "10": "*",
        "11": "+",
        "12": ",",
        "13": "-",
        "14": ".",
        "15": "/",
        "16": "0",
        "17": "1",
        "18": "2",
        "19": "3",
        "20": "4",
        "21": "5",
        "22": "6",
        "23": "7",
        "24": "8",
        "25": "9",
        "26": ":",
        "27": ";",
        "28": "<",
        "29": "=",
        "30": ">",
        "31": "?",
        "32": "@",
        "33": "A",
        "34": "B",
        "35": "C",
        "36": "D",
        "37": "E",
        "38": "F",
        "39": "G",
        "40": "H",
        "41": "I",
        "42": "J",
        "43": "K",
        "44": "L",
        "45": "M",
        "46": "N",
        "47": "O",
        "48": "P",
        "49": "Q",
        "50": "R",
        "51": "S",
        "52": "T",
        "53": "U",
        "54": "V",
        "55": "W",
        "56": "X",
        "57": "Y",
        "58": "Z",
        "59": "[",
        "60": "]",
        "61": "_",
        "62": "a",
        "63": "b",
        "64": "c",
        "65": "d",
        "66": "e",
        "67": "f",
        "68": "g",
        "69": "h",
        "70": "i",
        "71": "j",
        "72": "k",
        "73": "l",
        "74": "m",
        "75": "n",
        "76": "o",
        "77": "p",
        "78": "q",
        "79": "r",
        "80": "s",
        "81": "t",
        "82": "u",
        "83": "v",
        "84": "w",
        "85": "x",
        "86": "y",
        "87": "z",
        "88": "|",
        "89": "«",
        "90": "»",
        "91": "А",
        "92": "Б",
        "93": "В",
        "94": "Г",
        "95": "Д",
        "96": "Е",
        "97": "Ж",
        "98": "З",
        "99": "И",
        "100": "Й",
        "101": "К",
        "102": "Л",
        "103": "М",
        "104": "Н",
        "105": "О",
        "106": "П",
        "107": "Р",
        "108": "С",
        "109": "Т",
        "110": "У",
        "111": "Ф",
        "112": "Х",
        "113": "Ц",
        "114": "Ч",
        "115": "Ш",
        "116": "Щ",
        "117": "Ы",
        "118": "Ь",
        "119": "Э",
        "120": "Ю",
        "121": "Я",
        "122": "а",
        "123": "б",
        "124": "в",
        "125": "г",
        "126": "д",
        "127": "е",
        "128": "ж",
        "129": "з",
        "130": "и",
        "131": "й",
        "132": "к",
        "133": "л",
        "134": "м",
        "135": "н",
        "136": "о",
        "137": "п",
        "138": "р",
        "139": "с",
        "140": "т",
        "141": "у",
        "142": "ф",
        "143": "х",
        "144": "ц",
        "145": "ч",
        "146": "ш",
        "147": "щ",
        "148": "ъ",
        "149": "ы",
        "150": "ь",
        "151": "э",
        "152": "ю",
        "153": "я",
        "154": "ё",
        "155": "–",
        "156": "—",
        "157": "“",
        "158": "”",
        "159": "•",
        "160": "…",
        "161": "№",
        "162": "↑",
        "163": "→",
        "164": "↓",
        "165": "−",
        "166": "ꜝ",
        "167": "",
        "0": "<pad>"
    }
}